#include <iostream>
#include <corecrt_math_defines.h>

using namespace std;

int main()
{
    setlocale(LC_ALL, "ukr");

    long A = 70, B = 5, C = 3;
    long D = 180; // опис операнд≥в у памТ€т≥
    double Y, R;

    __asm {
        finit; очищенн€ рег≥стр≥в сп≥впроцесора
        fldpi; завантаженн€ у вершину стека числа 3, 1415Е
        fimul A; множенн€ числа Ђп≥ї на аргумент
        fidiv D; розпод≥л аргументу на 180
        fptan; обчисленн€ часткового тангенса
        fdiv; знаходженн€ тангенса
        fmul ST, ST; зведенн€ у квадрат
        fstp Y; вигружаЇмо тангенс у зм≥нну результату
        finit; очищенн€ рег≥стр≥в сп≥впроцесора
        fld Y; завантажуЇмо в стек Y = 3
        fimul C; завантажуЇмо в стек C = 3 та множимо на Y = 3 маЇмо 9
        fst Y; збер≥гаемо результат у зм≥нн≥й
        fld Y; завантажуЇмо Y в стек
        fld1; завантажуЇмо 1 в стек
        fdiv; д≥лимо 1 на Y(отримуЇмо 1 / Y)
        fst Y; збер≥гаЇмо 1 / Y у зм≥нну Y дл€ acos
        fld Y; завантажуЇмо 1 / Y в стек
        fld1; завантажуЇмо 1 в стек дл€ acos
        fpatan; обчислюЇмо арккосинус(1 / Y)
        fimul B; множимо результат на B
        fst R; збер≥гаемо результат у зм≥нн≥й у вигл€д≥ рад≥ан
        fldpi; переведенн€ з рад≥ан≥в Ц у градуси
        fdiv; переведенн€ з рад≥ан≥в Ц у градуси
        fimul D; переведенн€ з рад≥ан≥в Ц у градуси
        fstp Y; збер≥гаЇмо результат у зм≥нн≥й Y
    }

    cout << "–езультат в радiанах: " << R << endl;
    cout << "–езультат в градусах: " << Y << endl;
}